<?php
/**
 * Регистрация меню в шаблоне без регистрации в function
 * ---------------------------------------------------------------------------------------------------------------------
 */?>

<?php/************** ------- Указание название шаблона стр ------- **************/
/*
Template Name: page_template blog-page
*/
?>

<?php
wp_nav_menu( array(
	'theme_location'  => 'Top',
	'menu'	  => 'Боковое',
	'container_class' => '',
	'container_id'    => '',
	'menu_id'	  => 'main-top',
	'menu_class'	  => 'menu',
	'before'	  => ''
) );?>

<?php
function my_wp_nav_menu_args($args = '') //убираем контейнер меню
{
	$args['container'] = false;
	return $args;
}
?>

<?= get_field('группа')['поле_в_группе'];  ?> <!-- Вывод кастомного поля в группе - нужно создать поле тип (группа) и в нем создавать поля с разными значениями -->
