<?php
/**
 * The front page template file
 * ---------------------------------------------------------------------------------------------------------------------
 **/
get_header(); ?>


<?php
/**
 * Вывод постов на главной - простой цкл - вернет посты с типом post - работает только для вывода на главной стр
 * ---------------------------------------------------------------------------------------------------------------------
 **/
while (have_posts()) : the_post(); ?>
	<section class="section-article">
		<div class="container">
			<h2 class="title"><?php the_title(); //Title post main page ?></h2>
			<div class="content-main-page">
				<?php the_content(); //Content post main page ?>
			</div>
		</div>
	</section>
<?php endwhile; ?>


<?php
/**
 * Вывод постов на любой странице с шаблоном  - вернет посты с указанным типом post_type
 * ---------------------------------------------------------------------------------------------------------------------
 **/
$args = array(
    'post_type' => 'post', // Указание типа поста
    'publish' => true, // Указываем для вывода только посты в статусе опубликовано
    'paged' => get_query_var('paged'), // получение пагинации через $wp_query
);

query_posts($args); // Забираем все посты wp

    while ( have_posts()) : the_post(); // цыкл вывода постов

          //подключаем шаблон с контентом и тд поста
            get_template_part('template/post');

    endwhile;
/**
 * Вывод постов на любой странице с шаблоном  - вернет посты с указанным типом post_type
 * ---------------------------------------------------------------------------------------------------------------------
 **/?>

<?php
get_footer();
